In [ ]:
import pandas as pd

In [ ]:
#Method1: Specify Full Path to File

In [ ]:
stats = pd.read_csv('A:\Summer 2020\Python Course\Files\P4-Demographic-Data.csv')

In [ ]:
stats

In [ ]:
#Method2: Change Working Directory

In [ ]:
import os

In [ ]:
print(os.getcwd())

In [ ]:
#----

In [ ]:
stats

In [ ]:
###Exploring Data

In [ ]:
#FullDataFrame
stats

In [ ]:
#2. Number of Rows
len(stats)

In [ ]:
#3. See Columns
stats.columns

In [ ]:
#4. Number of Columns
len(stats.columns)

In [ ]:
#5. Top Rows
stats.head(6)

In [ ]:
#6.Bottom Rows
stats.tail(6)

In [ ]:
#7. Information on the columns
stats.info() #like the str functioon in R

In [ ]:
#8. Get stats on the columns 
stats.describe() #like summary() in R

In [ ]:
stats.describe().transpose()

In [ ]:
#Renaming Columns Through Data Frame

In [ ]:
stats.head()

In [ ]:
stats.columns

In [ ]:
stats.columns = ['Country Name', 'Country Code', 'Birth rate', 'Internet users',
       'Income Group']

In [ ]:
stats.head()

In [ ]:
 #---

In [ ]:
#Subsetting Data Frames in Pandas

In [ ]:
stats.head()

In [ ]:
#Three Parts
#Rows
#Columns
#Combine the Two

In [ ]:
#Part1 Rows
stats[21:26]#Default for data frames is Row Splitting. So the discrimination comes naturally.

In [ ]:
stats[185:]

In [ ]:
stats[:10]

In [ ]:
stats.head(10)

In [ ]:
#Reversing a data frame
stats[::-1]

In [ ]:
stats

In [ ]:
stat2 = stats[::-1]

In [ ]:
#Get omly every 20th row

In [ ]:
stat2= stats[::20]

In [ ]:
stat2

In [ ]:
#Part2: Columns
stats.columns

In [ ]:
stats['Country Name']

In [ ]:
stats['Country Name'].head()

In [ ]:
stats[['Country Name', 'Birth rate']].head()

In [ ]:
#In R you'd  e passing a Vector: c("CountryName", "BirthRate")

In [ ]:
#Quick Access: requires the name to be one  wordabs

In [ ]:
stats.Birthrate

In [ ]:
#Combing two columns

In [ ]:
stats[['Country Name','Birth rate']][4:8]

In [ ]:
stats.head()

In [ ]:
#Basic Operations With Data Frames

In [ ]:
 stats.head()

In [ ]:
stats.columns

In [ ]:
stats[['Country Code','Birth rate','Internet users']][4:8]

In [ ]:
#Mathematical Operation

In [ ]:
stats.columns = ['CountryName', 'CountryCode', 'BirthRate', 'InternetUsers',
       'IncomeGroup']

In [ ]:
result = stats.BirthRate * stats.InternetUsers
print(result)

In [ ]:
result.head()

In [ ]:
#Add Column

In [ ]:
stats['MyCalc']= stats.BirthRate * stats.InternetUsers

In [ ]:
stats.head()

In [ ]:


#Comparison to R
#stats['xyz'=[1,2,3,4,5] would be acceptable as R Recycles vectors until its full

In [ ]:
#Removing a column

In [ ]:
stats.drop('MyCalc',axis = 1)

In [ ]:
stats = stats.drop('MyCalc',axis = 1)

In [ ]:
stats.head()

In [ ]:
#Filtering Data Frames

In [ ]:
#Fitering is about Rows

In [ ]:
stats.head()

In [ ]:
stats.InternetUsers<2

In [ ]:
Filter = stats.InternetUsers<2

In [ ]:
Fiter

In [ ]:
stats[Filter]

In [ ]:
Filter2 =stats.BirthRate > 40

In [ ]:
Filter2

In [ ]:
stats[Filter2]

In [56]:
stats[(stats.BirthRate>40) & (stats.InternetUsers<3)]

         Country Name Country Code  BirthRate  InternetUsers Income Group
11            Burundi          BDI     44.151            1.3   Low income
127             Niger          NER     49.661            1.7   Low income
156           Somalia          SOM     43.891            1.5   Low income
167              Chad          TCD     45.745            2.3   Low income
192  Congo, Dem. Rep.          COD     42.394            2.2   Low income

In [54]:
stats.columns

Index(['Country Name', 'Country Code', 'Birth rate', 'Internet users',
       'Income Group'],
      dtype='object')

In [69]:
stats.columns=['CountryName', 'Country Code', 'BirthRate', 'InternetUsers',
       'IncomeGroup']

In [70]:
stats.head()

,CountryName,Country Code,BirthRate,InternetUsers,IncomeGroup
0,Aruba,ABW,10.244,78.9,High income
1,Afghanistan,AFG,35.253,5.9,Low income
2,Angola,AGO,45.985,19.1,Upper middle income
3,Albania,ALB,12.877,57.2,Upper middle income
4,United Arab Emirates,ARE,11.044,88.0,High income

In [71]:
stats[stats.IncomeGroup == "High income"]

               CountryName Country Code  BirthRate  InternetUsers  IncomeGroup
0                    Aruba          ABW     10.244          78.90  High income
4     United Arab Emirates          ARE     11.044          88.00  High income
5                Argentina          ARG     17.716          59.90  High income
7      Antigua and Barbuda          ATG     16.447          63.40  High income
8                Australia          AUS     13.200          83.00  High income
..                     ...          ...        ...            ...          ...
174    Trinidad and Tobago          TTO     14.590          63.80  High income
180                Uruguay          URY     14.374          57.69  High income
181          United States          USA     12.500          84.20  High income
184          Venezuela, RB          VEN     19.842          54.90  High income
185  Virgin Islands (U.S.)          VIR     10.700          45.30  High income

[67 rows x 5 columns]

In [72]:
stats.IncomeGroup.unique()

array(['High income', 'Low income', 'Upper middle income',
       'Lower middle income'], dtype=object)

In [73]:
#Exercise : Everything about Malta

In [74]:
stats[stats.CountryName == 'Malta']

    CountryName Country Code  BirthRate  InternetUsers  IncomeGroup
116       Malta          MLT        9.5        68.9138  High income

In [75]:
stats[stats.CountryName == 'India']

   CountryName Country Code  BirthRate  InternetUsers          IncomeGroup
80       India          IND     20.291           15.1  Lower middle income